In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine, inspect, text

In [2]:
# Create an SQLAlchemy engine to connect to the SQLite database
engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')

In [3]:
# Create function that returns sqlite tables as a dictionary of pandas dataframes
def sql_tables_to_df(sqlite_engine):
    """
    This function takes in a SQLite database and returns a pandas dataframe
    Arguments:
    engine: sqlalchemy engine
    table_name: name of the table to retrieve
    """

    # Create an Inspector instance to inspect the database
    inspector = inspect(sqlite_engine)

    # Get the table names from the database
    table_names = inspector.get_table_names()
    
    # Resulting dict of dataframes keyed by their names 
    dict_of_dfs = {}
    
    for table in table_names:
    
        # Define the SQL query using the SQLAlchemy text function
        query = f"SELECT * FROM {table}"
        query_text = text(query)
    
        # Connect to the database and execute the query
        with sqlite_engine.connect() as con:
            rs = con.execute(query_text)
            df = pd.DataFrame(rs.fetchall())
            df.columns = rs.keys()
        
        dict_of_dfs[table] = df
    
    return dict_of_dfs

In [4]:
# Executing function and getting dictionary of DataFrames
df_dict = sql_tables_to_df(engine)

In [5]:
# Print keys of the df dictionary
df_dict.keys()

dict_keys(['Bookings', 'Facilities', 'Members'])

In [6]:
# Assign dataframes to variables
bookings = df_dict[list(df_dict.keys())[0]]
facilities = df_dict[list(df_dict.keys())[1]]
members = df_dict[list(df_dict.keys())[2]]

In [7]:
# Preview bookings dataframe
bookings

      bookid  facid  memid            starttime  slots
0          0      3      1  2012-07-03 11:00:00      2
1          1      4      1  2012-07-03 08:00:00      2
2          2      6      0  2012-07-03 18:00:00      2
3          3      7      1  2012-07-03 19:00:00      2
4          4      8      1  2012-07-03 10:00:00      1
...      ...    ...    ...                  ...    ...
4038    4038      8     29  2012-09-30 16:30:00      2
4039    4039      8     29  2012-09-30 18:00:00      1
4040    4040      8     21  2012-09-30 18:30:00      1
4041    4041      8     16  2012-09-30 19:00:00      1
4042    4042      8     29  2012-09-30 19:30:00      1

[4043 rows x 5 columns]

In [8]:
# Change dtype of starttime to datetime object
bookings['starttime'] = pd.to_datetime(bookings['starttime'])
bookings['starttime'].dtype

dtype('<M8[ns]')

In [9]:
# Preview facilities dataframe
facilities

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000,200
1,1,Tennis Court 2,5.0,25.0,8000,200
2,2,Badminton Court,0.0,15.5,4000,50
3,3,Table Tennis,0.0,5.0,320,10
4,4,Massage Room 1,9.9,80.0,4000,3000
5,5,Massage Room 2,9.9,80.0,4000,3000
6,6,Squash Court,3.5,17.5,5000,80
7,7,Snooker Table,0.0,5.0,450,15
8,8,Pool Table,0.0,5.0,400,15

In [10]:
# Preview members dataframe
members

,memid,surname,firstname,address,zipcode,telephone,recommendedby,joindate
0,0,GUEST,GUEST,GUEST,0,(000) 000-0000,,2012-07-01 00:00:00
1,1,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05
2,2,Smith,Tracy,"8 Bloomsbury Close, New York",4321,555-555-5555,,2012-07-02 12:08:23
3,3,Rownam,Tim,"23 Highway Way, Boston",23423,(844) 693-0723,,2012-07-03 09:32:15
4,4,Joplette,Janice,"20 Crossing Road, New York",234,(833) 942-4710,1,2012-07-03 10:25:05
5,5,Butters,Gerald,"1065 Huntingdon Avenue, Boston",56754,(844) 078-4130,1,2012-07-09 10:44:09
6,6,Tracy,Burton,"3 Tunisia Drive, Boston",45678,(822) 354-9973,,2012-07-15 08:52:55
7,7,Dare,Nancy,"6 Hunting Lodge Way, Boston",10383,(833) 776-4001,4,2012-07-25 08:59:12
8,8,Boothe,Tim,"3 Bloomsbury Close, Reading, 00234",234,(811) 433-2547,3,2012-07-25 16:02:35
9,9,Stibbons,Ponder,"5 Dragons Way, Winchester",87630,(833) 160-3900,6,2012-07-25 17:09:05
10,10,Owen,Charles,"52 Cheshire Grove, Winchester, 28563",28563,(855) 542-5251,1,2012-08-03 19:42:37
11,11,Jones,David,"976 Gnats Close, Reading",33862,(844) 536-8036,4,2012-08-06 16:32:55
12,12,Baker,Anne,"55 Powdery Street, Boston",80743,844-076-5141,9,2012-08-10 14:23:22
13,13,Farrell,Jemima,"103 Firth Avenue, North Reading",57392,(855) 016-0163,,2012-08-10 14:28:01
14,14,Smith,Jack,"252 Binkington Way, Boston",69302,(822) 163-3254,1,2012-08-10 16:22:05
15,15,Bader,Florence,"264 Ursula Drive, Westford",84923,(833) 499-3527,9,2012-08-10 17:52:03
16,16,Baker,Timothy,"329 James Street, Reading",58393,833-941-0824,13,2012-08-15 10:34:25
17,17,Pinker,David,"5 Impreza Road, Boston",65332,811 409-6734,13,2012-08-16 11:32:47
18,20,Genting,Matthew,"4 Nunnington Place, Wingfield, Boston",52365,(811) 972-1377,5,2012-08-19 14:55:55
19,21,Mackenzie,Anna,"64 Perkington Lane, Reading",64577,(822) 661-2898,1,2012-08-26 09:32:05
20,22,Coplin,Joan,"85 Bard Street, Bloomington, Boston",43533,(822) 499-2232,16,2012-08-29 08:32:41
21,24,Sarwin,Ramnaresh,"12 Bullington Lane, Boston",65464,(822) 413-1470,15,2012-09-01 08:44:42
22,26,Jones,Douglas,"976 Gnats Close, Reading",11986,844 536-8036,11,2012-09-02 18:43:05
23,27,Rumney,Henrietta,"3 Burkington Plaza, Boston",78533,(822) 989-8876,20,2012-09-05 08:42:35
24,28,Farrell,David,"437 Granite Farm Road, Westford",43532,(855) 755-9876,,2012-09-15 08:22:05
25,29,Worthington-Smyth,Henry,"55 Jagbi Way, North Reading",97676,(855) 894-3758,2,2012-09-17 12:27:15
26,30,Purview,Millicent,"641 Drudgery Close, Burnington, Boston",34232,(855) 941-9786,2,2012-09-18 19:04:01
27,33,Tupperware,Hyacinth,"33 Cheerful Plaza, Drake Road, Westford",68666,(822) 665-5327,,2012-09-18 19:32:05
28,35,Hunt,John,"5 Bullington Lane, Boston",54333,(899) 720-6978,30,2012-09-19 11:32:45
29,36,Crumpet,Erica,"Crimson Road, North Reading",75655,(811) 732-4816,2,2012-09-22 08:36:38
30,37,Smith,Darren,"3 Funktown, Denzington, Boston",66796,(822) 577-3541,,2012-09-26 18:08:45

In [11]:
# Check recommended by column values
members['recommendedby'].unique()

array(['', '1', '4', '3', '6', '9', '13', '5', '16', '15', '11', '20',
       '2', '30'], dtype=object)

In [12]:
# They are all numeric values, so we change dtype to float (as we have empty stings)

# Replace empty strings with NaN
members['recommendedby'] = members['recommendedby'].replace('', np.nan)

# Covert to integer dtype
members['recommendedby'] = members['recommendedby'].astype(float)

members['recommendedby'].dtype

dtype('float64')

In [13]:
members['recommendedby'].unique()

array([nan,  1.,  4.,  3.,  6.,  9., 13.,  5., 16., 15., 11., 20.,  2.,
       30.])

In [14]:
# Merging all data frames into one
df_merged = pd.merge(bookings, facilities, how='left', on='facid').merge(members, how='left', on='memid')
df_merged

,bookid,facid,memid,starttime,slots,name,membercost,guestcost,initialoutlay,monthlymaintenance,surname,firstname,address,zipcode,telephone,recommendedby,joindate
0,0,3,1,2012-07-03 11:00:00,2,Table Tennis,0.0,5.0,320,10,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,NaN,2012-07-02 12:02:05
1,1,4,1,2012-07-03 08:00:00,2,Massage Room 1,9.9,80.0,4000,3000,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,NaN,2012-07-02 12:02:05
2,2,6,0,2012-07-03 18:00:00,2,Squash Court,3.5,17.5,5000,80,GUEST,GUEST,GUEST,0,(000) 000-0000,NaN,2012-07-01 00:00:00
3,3,7,1,2012-07-03 19:00:00,2,Snooker Table,0.0,5.0,450,15,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,NaN,2012-07-02 12:02:05
4,4,8,1,2012-07-03 10:00:00,1,Pool Table,0.0,5.0,400,15,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,NaN,2012-07-02 12:02:05
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4038,4038,8,29,2012-09-30 16:30:00,2,Pool Table,0.0,5.0,400,15,Worthington-Smyth,Henry,"55 Jagbi Way, North Reading",97676,(855) 894-3758,2.0,2012-09-17 12:27:15
4039,4039,8,29,2012-09-30 18:00:00,1,Pool Table,0.0,5.0,400,15,Worthington-Smyth,Henry,"55 Jagbi Way, North Reading",97676,(855) 894-3758,2.0,2012-09-17 12:27:15
4040,4040,8,21,2012-09-30 18:30:00,1,Pool Table,0.0,5.0,400,15,Mackenzie,Anna,"64 Perkington Lane, Reading",64577,(822) 661-2898,1.0,2012-08-26 09:32:05
4041,4041,8,16,2012-09-30 19:00:00,1,Pool Table,0.0,5.0,400,15,Baker,Timothy,"329 James Street, Reading",58393,833-941-0824,13.0,2012-08-15 10:34:25
4042,4042,8,29,2012-09-30 19:30:00,1,Pool Table,0.0,5.0,400,15,Worthington-Smyth,Henry,"55 Jagbi Way, North Reading",97676,(855) 894-3758,2.0,2012-09-17 12:27:15

In [15]:
# Get info for the dataframe
df_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4043 entries, 0 to 4042
Data columns (total 17 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   bookid              4043 non-null   int64
 1   facid               4043 non-null   int64
 2   memid               4043 non-null   int64
 3   starttime           4043 non-null   datetime64[ns]
 4   slots               4043 non-null   int64
 5   name                4043 non-null   object
 6   membercost          4043 non-null   float64
 7   guestcost           4043 non-null   float64
 8   initialoutlay       4043 non-null   int64
 9   monthlymaintenance  4043 non-null   int64
 10  surname             4043 non-null   object
 11  firstname           4043 non-null   object
 12  address             4043 non-null   object
 13  zipcode             4043 non-null   int64
 14  telephone           4043 non-null   object
 15  recommendedby       1975 non-null   float64
 16  joindate            4043 non-null   object
dtypes: datetime64[ns](1), float64(3), int64(7), object(6)
memory usage: 568.5+ KB

In [16]:
# Function that calculates total cost based on slot price for guests and members and number of slots
def calc_total_cost(row):
    return row['slots'] * row['guestcost'] if row['memid'] == 0 else row['slots'] * row['membercost']

In [17]:
# Create new df and column 'total' and apply the function
df_merged_total = df_merged.copy()
df_merged_total['total_cost'] = df_merged_total.apply(calc_total_cost, axis=1)

In [18]:
# Visually check the result
df_merged_total[['memid', 'guestcost', 'membercost', 'slots', 'total_cost']]

      memid  guestcost  membercost  slots  total_cost
0         1        5.0         0.0      2         0.0
1         1       80.0         9.9      2        19.8
2         0       17.5         3.5      2        35.0
3         1        5.0         0.0      2         0.0
4         1        5.0         0.0      1         0.0
...     ...        ...         ...    ...         ...
4038     29        5.0         0.0      2         0.0
4039     29        5.0         0.0      1         0.0
4040     21        5.0         0.0      1         0.0
4041     16        5.0         0.0      1         0.0
4042     29        5.0         0.0      1         0.0

[4043 rows x 5 columns]

## Questions

Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember that there's a different cost for guests and members!

In [19]:
less_than_1000 = df_merged_total.groupby('name')['total_cost'].sum().sort_values(ascending=False)
less_than_1000[less_than_1000 < 1000]

name
Pool Table       270.0
Snooker Table    240.0
Table Tennis     180.0
Name: total_cost, dtype: float64

Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order

In [20]:
# Get the df with first, last names and recommended by columns
df_members_name_info = members[['memid', 'surname', 'firstname', 'recommendedby']]
df_members_name_info = df_members_name_info.loc[df_members_name_info['surname'] != 'GUEST']
df_members_name_info

    memid            surname  firstname  recommendedby
1       1              Smith     Darren            NaN
2       2              Smith      Tracy            NaN
3       3             Rownam        Tim            NaN
4       4           Joplette     Janice            1.0
5       5            Butters     Gerald            1.0
6       6              Tracy     Burton            NaN
7       7               Dare      Nancy            4.0
8       8             Boothe        Tim            3.0
9       9           Stibbons     Ponder            6.0
10     10               Owen    Charles            1.0
11     11              Jones      David            4.0
12     12              Baker       Anne            9.0
13     13            Farrell     Jemima            NaN
14     14              Smith       Jack            1.0
15     15              Bader   Florence            9.0
16     16              Baker    Timothy           13.0
17     17             Pinker      David           13.0
18     20            Genting    Matthew            5.0
19     21          Mackenzie       Anna            1.0
20     22             Coplin       Joan           16.0
21     24             Sarwin  Ramnaresh           15.0
22     26              Jones    Douglas           11.0
23     27             Rumney  Henrietta           20.0
24     28            Farrell      David            NaN
25     29  Worthington-Smyth      Henry            2.0
26     30            Purview  Millicent            2.0
27     33         Tupperware   Hyacinth            NaN
28     35               Hunt       John           30.0
29     36            Crumpet      Erica            2.0
30     37              Smith     Darren            NaN

In [21]:
# Left join facilities df on facid = recommendedBy
df_members_name_recommend = df_members_name_info.merge(df_members_name_info, 
                                                       left_on='recommendedby', right_on='memid',
                                                       suffixes=('_mem', '_rec'))
df_members_name_recommend[['surname_mem', 'firstname_mem', 'surname_rec', 'firstname_rec']]

          surname_mem firstname_mem surname_rec firstname_rec
0            Joplette        Janice       Smith        Darren
1             Butters        Gerald       Smith        Darren
2                Owen       Charles       Smith        Darren
3               Smith          Jack       Smith        Darren
4           Mackenzie          Anna       Smith        Darren
5                Dare         Nancy    Joplette        Janice
6               Jones         David    Joplette        Janice
7              Boothe           Tim      Rownam           Tim
8            Stibbons        Ponder       Tracy        Burton
9               Baker          Anne    Stibbons        Ponder
10              Bader      Florence    Stibbons        Ponder
11              Baker       Timothy     Farrell        Jemima
12             Pinker         David     Farrell        Jemima
13            Genting       Matthew     Butters        Gerald
14             Coplin          Joan       Baker       Timothy
15             Sarwin     Ramnaresh       Bader      Florence
16              Jones       Douglas       Jones         David
17             Rumney     Henrietta     Genting       Matthew
18  Worthington-Smyth         Henry       Smith         Tracy
19            Purview     Millicent       Smith         Tracy
20            Crumpet         Erica       Smith         Tracy
21               Hunt          John     Purview     Millicent

In [22]:
# Producing report
for facility, row in enumerate(df_members_name_recommend.itertuples()):
    print(f'{facility + 1}. {row.surname_mem} {row.firstname_mem} was recommended by {row.surname_rec} {row.firstname_rec}')

1. Joplette Janice was recommended by Smith Darren
2. Butters Gerald was recommended by Smith Darren
3. Owen Charles was recommended by Smith Darren
4. Smith Jack was recommended by Smith Darren
5. Mackenzie Anna was recommended by Smith Darren
6. Dare Nancy was recommended by Joplette Janice
7. Jones David was recommended by Joplette Janice
8. Boothe Tim was recommended by Rownam Tim
9. Stibbons Ponder was recommended by Tracy Burton
10. Baker Anne was recommended by Stibbons Ponder
11. Bader Florence was recommended by Stibbons Ponder
12. Baker Timothy was recommended by Farrell Jemima
13. Pinker David was recommended by Farrell Jemima
14. Genting Matthew was recommended by Butters Gerald
15. Coplin Joan was recommended by Baker Timothy
16. Sarwin Ramnaresh was recommended by Bader Florence
17. Jones Douglas was recommended by Jones David
18. Rumney Henrietta was recommended by Genting Matthew
19. Worthington-Smyth Henry was recommended by Smith Tracy
20. Purview Millicent was recommended by Smith Tracy
21. Crumpet Erica was recommended by Smith Tracy
22. Hunt John was recommended by Purview Millicent

Q12: Find the facilities with their usage by member, but not guests

In [23]:
# Sort dataframe by facid and memid
df_by_facility = df_merged.sort_values(by=['facid', 'memid'])
df_by_facility = df_by_facility.loc[df_by_facility['memid'] != 0]
df_by_facility['full_name'] = df_by_facility['firstname'] + ' ' + df_by_facility['surname']
df_by_facility['facility_name'] = df_by_facility['name']
df_by_facility = df_by_facility[['facility_name', 'full_name', 'slots']]

df_by_facility

       facility_name            full_name  slots
6     Tennis Court 1          Tracy Smith      3
7     Tennis Court 1          Tracy Smith      3
28    Tennis Court 1          Tracy Smith      3
36    Tennis Court 1          Tracy Smith      3
38    Tennis Court 1          Tracy Smith      3
...              ...                  ...    ...
3426      Pool Table  Hyacinth Tupperware      1
3545      Pool Table  Hyacinth Tupperware      1
3696      Pool Table  Hyacinth Tupperware      1
3817      Pool Table  Hyacinth Tupperware      1
3972      Pool Table  Hyacinth Tupperware      1

[3160 rows x 3 columns]

In [24]:
# Calculate time spent by each member
df_by_facility_group = df_by_facility.groupby(['facility_name', 'full_name'])['slots'].sum().reset_index()
df_by_facility_group['usage_time_min'] = df_by_facility['slots'] * 30
df_by_facility_group = df_by_facility_group[['facility_name', 'full_name', 'usage_time_min']].dropna()
df_by_facility_group['usage_time_min'] = df_by_facility_group['usage_time_min'].astype(int)

In [25]:
# Print report
for facility in facilities['name'].tolist():
    print(f'{facility}:')
    facility_df = df_by_facility_group.loc[df_by_facility_group['facility_name'] == facility]
    for row in facility_df.itertuples():
        print(f'\t{row.full_name} spent {row.usage_time_min} min')
    print('\n')

Tennis Court 1:
	Anne Baker spent 90 min
	Burton Tracy spent 90 min
	Charles Owen spent 90 min
	David Farrell spent 90 min
	David Pinker spent 90 min
	Douglas Jones spent 60 min
	Erica Crumpet spent 60 min
	Florence Bader spent 60 min
	Jack Smith spent 60 min
	Jemima Farrell spent 60 min
	Joan Coplin spent 60 min
	John Hunt spent 60 min
	Matthew Genting spent 60 min
	Nancy Dare spent 30 min
	Ponder Stibbons spent 30 min
	Ramnaresh Sarwin spent 90 min
	Tim Rownam spent 90 min


Tennis Court 2:
	Anne Baker spent 90 min
	Burton Tracy spent 90 min
	Charles Owen spent 60 min
	Darren Smith spent 60 min
	David Jones spent 60 min
	Florence Bader spent 60 min
	Gerald Butters spent 60 min
	Henrietta Rumney spent 30 min
	Jack Smith spent 30 min
	Janice Joplette spent 30 min
	Jemima Farrell spent 30 min
	John Hunt spent 90 min
	Millicent Purview spent 90 min
	Nancy Dare spent 90 min
	Ramnaresh Sarwin spent 90 min
	Tim Boothe spent 60 min
	Tim Rownam spent 60 min
	Timothy Baker spent 60 min
	Tracy Smith spent 60 min


Badminton Court:
	Anna Mackenzie spent 60 min
	Anne Baker spent 60 min
	Charles Owen spent 60 min
	Darren Smith spent 30 min
	David Jones spent 30 min
	David Pinker spent 90 min
	Douglas Jones spent 90 min
	Erica Crumpet spent 60 min
	Jack Smith spent 60 min
	Jemima Farrell spent 60 min
	John Hunt spent 30 min
	Millicent Purview spent 30 min
	Ponder Stibbons spent 90 min
	Ramnaresh Sarwin spent 60 min
	Tim Boothe spent 60 min
	Tim Rownam spent 60 min
	Tracy Smith spent 60 min


Table Tennis:
	Anna Mackenzie spent 60 min
	Burton Tracy spent 60 min
	Charles Owen spent 60 min
	Darren Smith spent 60 min
	David Jones spent 30 min
	David Pinker spent 90 min
	Erica Crumpet spent 90 min
	Florence Bader spent 90 min
	Gerald Butters spent 90 min
	Henry Worthington-Smyth spent 90 min
	Janice Joplette spent 90 min
	Matthew Genting spent 60 min
	Millicent Purview spent 60 min
	Ramnaresh Sarwin spent 60 min
	Tim Boothe spent 60 min
	Timothy Baker spent 30 min
	Tracy Smith spent 90 min


Massage Room 1:
	Anna Mackenzie spent 60 min
	Anne Baker spent 30 min
	Darren Smith spent 90 min
	David Jones spent 90 min
	David Pinker spent 60 min
	Erica Crumpet spent 60 min
	Gerald Butters spent 60 min
	Henry Worthington-Smyth spent 60 min
	Hyacinth Tupperware spent 60 min
	Jack Smith spent 30 min
	Janice Joplette spent 90 min
	Joan Coplin spent 90 min
	John Hunt spent 90 min
	Matthew Genting spent 90 min
	Nancy Dare spent 90 min
	Ponder Stibbons spent 90 min
	Ramnaresh Sarwin spent 60 min
	Tim Boothe spent 60 min
	Tim Rownam spent 60 min


Massage Room 2:
	Anne Baker spent 60 min
	Charles Owen spent 60 min
	Florence Bader spent 60 min
	Gerald Butters spent 30 min
	Jack Smith spent 60 min
	Janice Joplette spent 90 min
	Joan Coplin spent 90 min
	Matthew Genting spent 90 min
	Nancy Dare spent 90 min
	Ramnaresh Sarwin spent 60 min
	Tim Rownam spent 60 min


Squash Court:
	Burton Tracy spent 90 min
	Charles Owen spent 90 min
	David Jones spent 60 min
	Douglas Jones spent 60 min
	Gerald Butters spent 60 min
	Joan Coplin spent 30 min
	John Hunt spent 30 min
	Ponder Stibbons spent 90 min
	Ramnaresh Sarwin spent 90 min
	Tim Boothe spent 90 min
	Timothy Baker spent 90 min
	Tracy Smith spent 60 min


Snooker Table:
	Anna Mackenzie spent 30 min
	Darren Smith spent 60 min
	David Farrell spent 60 min
	David Jones spent 60 min
	David Pinker spent 60 min
	Florence Bader spent 60 min
	Henrietta Rumney spent 60 min
	Jack Smith spent 120 min
	Matthew Genting spent 60 min
	Millicent Purview spent 60 min
	Ponder Stibbons spent 30 min
	Ramnaresh Sarwin spent 30 min
	Tim Boothe spent 90 min
	Tracy Smith spent 90 min


Pool Table:
	Anna Mackenzie spent 60 min
	Burton Tracy spent 60 min
	David Pinker spent 60 min
	Douglas Jones spent 60 min
	Florence Bader spent 30 min
	Gerald Butters spent 30 min
	Henrietta Rumney spent 90 min
	Henry Worthington-Smyth spent 90 min
	Hyacinth Tupperware spent 90 min
	Janice Joplette spent 90 min
	Jemima Farrell spent 180 min
	Matthew Genting spent 60 min
	Millicent Purview spent 60 min
	Nancy Dare spent 60 min
	Ponder Stibbons spent 60 min
	Tim Boothe spent 60 min
	Timothy Baker spent 30 min
	Tracy Smith spent 30 min

Q13: Find the facilities usage by month, but not guests

In [26]:
# Prepare dataframe
df_facility_monthly_usage = df_merged.loc[df_merged['memid'] != 0][['name', 'starttime', 'slots']]
df_facility_monthly_usage['monthly_usage_min'] = df_facility_monthly_usage['slots'] * 30
df_facility_monthly_usage.groupby(['name', 'starttime']).sum().reset_index()

                 name           starttime  slots  monthly_usage_min
0     Badminton Court 2012-07-05 09:30:00      3                 90
1     Badminton Court 2012-07-06 17:00:00      3                 90
2     Badminton Court 2012-07-07 09:00:00      3                 90
3     Badminton Court 2012-07-07 11:30:00      3                 90
4     Badminton Court 2012-07-07 16:00:00      3                 90
...               ...                 ...    ...                ...
3155   Tennis Court 2 2012-09-30 08:30:00      3                 90
3156   Tennis Court 2 2012-09-30 11:30:00      3                 90
3157   Tennis Court 2 2012-09-30 13:30:00      6                180
3158   Tennis Court 2 2012-09-30 16:30:00      3                 90
3159   Tennis Court 2 2012-09-30 18:30:00      3                 90

[3160 rows x 4 columns]

In [27]:
# Get month and sort by facility name and month
df_facility_monthly_usage['month'] = df_facility_monthly_usage['starttime'].dt.strftime('%b')
df_facility_monthly_usage = df_facility_monthly_usage[['name', 'month', 'monthly_usage_min']].groupby(['name', 'month']).sum().reset_index()
df_facility_monthly_usage.sort_values(by=['name', 'month'], ascending=True, inplace=True)
df_facility_monthly_usage

               name month  monthly_usage_min
0   Badminton Court   Aug              12420
1   Badminton Court   Jul               4950
2   Badminton Court   Sep              15210
3    Massage Room 1   Aug               9480
4    Massage Room 1   Jul               4980
5    Massage Room 1   Sep              12060
6    Massage Room 2   Aug                540
7    Massage Room 2   Jul                240
8    Massage Room 2   Sep                840
9        Pool Table   Aug               9090
10       Pool Table   Jul               3300
11       Pool Table   Sep              13290
12    Snooker Table   Aug               9480
13    Snooker Table   Jul               4200
14    Snooker Table   Sep              12120
15     Squash Court   Aug               5520
16     Squash Court   Jul               1500
17     Squash Court   Sep               5520
18     Table Tennis   Aug               8880
19     Table Tennis   Jul               2940
20     Table Tennis   Sep              12000
21   Tennis Court 1   Aug              10170
22   Tennis Court 1   Jul               6030
23   Tennis Court 1   Sep              12510
24   Tennis Court 2   Aug              10350
25   Tennis Court 2   Jul               3690
26   Tennis Court 2   Sep              12420

In [28]:
# Print report

for facility in facilities['name'].tolist():
    print(f'Monthly usage of {facility}:')
    facility_df = df_facility_monthly_usage.loc[df_facility_monthly_usage['name'] == facility]
    for row in facility_df.itertuples():
        print(f'\t{row.monthly_usage_min} minutes in {row.month}')
    print('\n')

Monthly usage of Tennis Court 1:
	10170 minutes in Aug
	6030 minutes in Jul
	12510 minutes in Sep


Monthly usage of Tennis Court 2:
	10350 minutes in Aug
	3690 minutes in Jul
	12420 minutes in Sep


Monthly usage of Badminton Court:
	12420 minutes in Aug
	4950 minutes in Jul
	15210 minutes in Sep


Monthly usage of Table Tennis:
	8880 minutes in Aug
	2940 minutes in Jul
	12000 minutes in Sep


Monthly usage of Massage Room 1:
	9480 minutes in Aug
	4980 minutes in Jul
	12060 minutes in Sep


Monthly usage of Massage Room 2:
	540 minutes in Aug
	240 minutes in Jul
	840 minutes in Sep


Monthly usage of Squash Court:
	5520 minutes in Aug
	1500 minutes in Jul
	5520 minutes in Sep


Monthly usage of Snooker Table:
	9480 minutes in Aug
	4200 minutes in Jul
	12120 minutes in Sep


Monthly usage of Pool Table:
	9090 minutes in Aug
	3300 minutes in Jul
	13290 minutes in Sep